{
  "basic_info": {
    "description_header": "Hello",
    "description": "👋 I'm Mahesh Paliwal a passionate backend engineer, problem solver, entrepreneur, and explorer.With a passion for innovation and a talent for finding solutions to complex problems. As an entrepreneur, I have created innovative products that have made a positive impact on people's lives. When not building businesses or solving problems, I can be found exploring the world, seeking out new adventures and experiences. ❤️ ",
    "section_name": {
      "about": "About me",
      "projects": "Recent Work",
      "skills": "Skills",
      "experience": "Experience"
    }
  },
  "projects": [
    {
      "title": "Speaker: NodeJs Global Summit",
      "startDate": "2023",
      "description": "At the event, I discussed the concept of asynchronous programming in Node.js using threads, event loop, and libuv.I explained how Node.js utilizes a single thread for handling I/O operations and how libuv library allows Node.js to delegate certain tasks to worker threads, thus improving performance. I also talked about the event loop and how it enables Node.js to process multiple tasks efficiently. Additionally,I covered the advantages and trade-offs of using threads and event loop in different scenarios, and shared some best practices for handling concurrency in Node.js. Overall, the discussion provided valuable insights into the inner workings of Node.js and how to write efficient and scalable applications using asynchronous programming techniques.",
      "images": [
        "https://ik.imagekit.io/ctraedfvm/node1.png?auto=format&ik-sdk-version=javascript-1.4.3&updatedAt=1676140730108",
        "https://ik.imagekit.io/ctraedfvm/node2.png?auto=format&ik-sdk-version=javascript-1.4.3&updatedAt=1676140747902"
      ],
      "url": "https://www.linkedin.com/in/maheshpaliwal/",
      "technologies": [
        {
          "class": "devicon-nodejs-plain",
          "name": "Nodejs"
        }
      ],
      "videos": [
        "https://www.youtube.com/embed/seGVmqw2vTY?start=6166",
        "https://www.youtube.com/embed/seGVmqw2vTY?start=7959"
      ]
    },{
      "title": "Stability Prediction of Residual Soil and Rock Slope",
      "startDate": "2022",
      "description": "There are various problems associated with calculating the factor of safety of the hills in the Himalayan region. Various tests are to be performed, which are very time consuming and expensive. As by nature, the slopes are not uniform. There can be a sudden change in the geomaterial (soil to rock and vice versa) within a few hundred meters. Thus, carrying out conventional geotechnical investigations over a stretch having several rocks and soil slope is very cumbersome. An effort has been made to quickly identify the stability of both the rock slope and residual soil slope. Numerical simulation results from previous studies on residual soil and rock slope were used to develop the ANN models. Various performance indices were used to highlight the high efficiency of the developed ANN models. The developed ANN models were further used to develop a mobile application for slope stability assessment.",
      "images": [
        "https://ik.imagekit.io/ctraedfvm/portfolio/ai/p1.png?ik-sdk-version=javascript-1.4.3&updatedAt=1676209014235",
        "https://ik.imagekit.io/ctraedfvm/portfolio/ai/p2.png",
        "https://ik.imagekit.io/ctraedfvm/portfolio/ai/p3.png"
      ],
      "url": "https://www.hindawi.com/journals/ace/2022/4121193/?utm_medium=author&utm_source=Hindawi",
      "technologies": [
      ]
    },
    {
      "title": "Demystifying complex problem solving",
      "startDate": "2022",
      "description": "In the talk, Mahesh began by defining what constitutes a complex problem, highlighting the various factors that contribute to its complexity, such as ambiguity, uncertainty, and multiple interrelated variables. Mahesh then provided the audience with practical steps to break down these problems into smaller, more manageable components, emphasizing the importance of clear problem definition, gathering relevant data, and collaboration. Mahesh went on to discuss various strategies and frameworks for approaching complex problems, such as the Five Whys, Root Cause Analysis, and Design Thinking, highlighting the benefits and limitations of each approach. Mahesh also discussed the importance of identifying underlying assumptions and biases and how they can impact the problem-solving process.Throughout the talk, Mahesh provided real-world examples of how these strategies can be applied in various industries and situations, making the content highly relatable and accessible to the audience. Overall, the talk was highly informative, and the audience left with a deeper understanding of how to approach and solve complex problems in their personal and professional lives.",
      "images": [
        "https://ik.imagekit.io/ctraedfvm/portfolio/dcp/p1.png?ik-sdk-version=javascript-1.4.3&updatedAt=1676141071514"
      ],
      "url": "https://www.linkedin.com/in/maheshpaliwal/",
      "technologies": [
      ]
    },
    {
      "title": "Smart Miner",
      "startDate": "2019",
      "description": "Himalaya is a region that is particularly susceptible to landslides due to various factors that affect the stability of the slopes. However, assessing the stability of a slope can be a challenging and time-consuming task for engineers due to the many parameters involved. To address this problem, I have developed the Smart Miner app that provides engineers with a quick and reliable way to assess residual soil and rock slope behavior and identify potential hazardous slopes. The Smart Miner app uses advanced algorithms and machine learning models to predict the risk of slope failure for residual soil and rock, calculate the factor of safety of rock slopes, and classify residual soil. By providing this information, the app helps engineers make informed decisions about slope stability and take the necessary steps to prevent potential disasters. Overall, the Smart Miner app is a valuable tool for engineers working in the Himalayan region and other areas prone to landslides. It helps them save time and resources while ensuring the safety of the public and infrastructure in the area.",
      "images": [
        "https://ik.imagekit.io/ctraedfvm/portfolio/sm/p3.jpeg",
        "https://ik.imagekit.io/ctraedfvm/portfolio/sm/p1.png"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-java-plain",
          "name": "Java"
        },
        {
          "class": "devicon-kotlin-plain",
          "name": "Kotlin"
        }]
    },
    {
      "title": "SpoonFeeder",
      "startDate": "2018",
      "description": "Mahesh built an app with the aim of providing food and shelter to those in need in India. The goal of the app was to help make India a hunger-free country by ensuring that everyone has access to food and shelter. The app features an intuitive and easy-to-use interface, which allows users to easily locate nearby food banks and shelters. The app also includes a feature that enables users to donate to local shelters and organizations, helping to ensure that they have the necessary resources to provide food and shelter to those in need.",
      "images": [
        "https://ik.imagekit.io/ctraedfvm/portfolio/spoonfeeder/p2.png",
        "https://ik.imagekit.io/ctraedfvm/portfolio/spoonfeeder/p4.jpg",
        "https://ik.imagekit.io/ctraedfvm/portfolio/spoonfeeder/p3.png"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-java-plain",
          "name": "Java"
        }]
    },
    {
      "title": "AUTO DETECTION OF METHANE GAS",
      "startDate": "2017",
      "description": "I built an IoT device that measures the concentration of toxic gases. The device is specifically designed for use in underground mines, where toxic gas concentrations can reach dangerous levels. The goal was to provide an automated solution that can take measurements without requiring any manpower, ensuring the safety of miners. To achieve this goal, I designed and built a prototype that is fully automated. The device can take measurements of the concentration of toxic gases and transmit the data wirelessly to a central monitoring system. The device is equipped with sensors that can detect the presence of various gases, including carbon monoxide, methane, and hydrogen sulfide. In addition, the prototype is designed to be rugged and durable, capable of withstanding the harsh conditions of an underground mine.",
      "images": [
        "https://ik.imagekit.io/ctraedfvm/portfolio/md/p1.jpeg"
      ],
      "url": "",
      "technologies": [
        {
          "class": "devicon-cplusplus-plain",
          "name": "C++"
        }]
    }
  ],
  "experience": [
    {
      "company": "Blinkit",
      "title": "Software Engineer",
      "years": "10.2022 - present",
      "mainTech": [
        "Golang", "Python", "Ruby"
      ],
      "technologies": [
        "REST API",
        "Golang",
        "Python",
        "Rails",
        "Ruby",
        "Postgresql",
        "MySQL",
        "Redis",
        "MongoDB",
        "DynamoDB"
      ]
    },
    {
      "company": "MamaEarth",
      "title": "Software Engineer",
      "years": "12.2020 - 10.2022",
      "mainTech": [
        "Nodejs", "Express", "MySQL", "MongoDb"
      ],
      "technologies": [
        "REST API",
        "JavaScript",
        "Algorithms",
        "Nodejs",
        "MongoDb",
        "Software Architectural Design",
        "Systems Design",
        "RESTful WebServices",
        "Redis",
        "MongoDB",
        "Low-Level Design",
        "Microservices",
        "Object-Oriented Programming (OOP)",
        "PHP"
      ]
    },
    {
      "company": "Oye Rickshaw",
      "title": "Software Engineer",
      "years": "10.2019 - 12.2020",
      "mainTech": [
        "Nodejs", "Express", "MySQL", "Kafka"
      ],
      "technologies": [
        "REST API",
        "JavaScript",
        "Algorithms",
        "Nodejs",
        "MongoDb",
        "Software Architectural Design",
        "Systems Design",
        "RESTful WebServices",
        "Redis",
        "MongoDB"
      ]
    },
    {
      "company": "Policybazaar",
      "title": "Intern",
      "years": "10.2019 - 05.2020",
      "mainTech": [
        "Nodejs"
      ],
      "technologies": [
        "REST API",
        "JavaScript",
        "Algorithms",
        "Nodejs",
        "MongoDb"
      ]
    },
    {
      "company": "Policybazaar",
      "title": "Summer Intern",
      "years": "05.2019 - 07.2019",
      "mainTech": [
        "Kotlin"
      ],
      "technologies": [
        "REST API",
        "JavaScript",
        "Algorithms",
        "kotlin",
        "Java"
      ]
    },
    {
      "company": "Serros Solutions",
      "title": "Shree Cement Ltd.",
      "years": "05.2018 - 07.2018",
      "mainTech": [
        "Docker"
      ],
      "technologies": [
        "Git",
        "Docker",
        "Openstack"
      ]
    }
  ]
}